# Rebar Free Form Creation Result Properties

Source: https://www.revitapidocs.com/2026/6a801dc2-e644-cf15-a4f0-e22c13c8c1ba.htm

---

| Rebar Free Form Creation Result Properties |
| --- |

The RebarFreeFormCreationResult type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Error | Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Rebar | Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a Rebar. |

Top See Also

#### Reference

RebarFreeFormCreationResult Class Autodesk.Revit.DB.Structure Namespace